{-# OPTIONS --allow-unsolved-metas #-}
module lemmas where

open import rules public
open import logical-relations public

L1′ : ∀ (Σ₁ Σ₂ : Sens) → (Σ₁ +[qty] Σ₂) ≡ (Σ₂ +[qty] Σ₁)
L1′ Σ₁ Σ₂ = commu[+]< Σ₁ , Σ₂ >

L1 : ∀ {N} (Σ₁ Σ₂ : Σ[ N ]) → (Σ₁ ⨰ Σ₂) ≡ (Σ₂ ⨰ Σ₁)
L1 [] [] = ↯
L1 (x ∷ a) (x₁ ∷ b) rewrite commu[×]< x , x₁ > | L1 a b = ↯

L0-1 : ∀ {N} (Σ : Σ[ N ]) → zero ⨰ Σ ≡< qty ℕ > ⟨ 0 ⟩
L0-1 e = lzero[⨰]< e >

L0-3 : ∀ (s : Sens) → ⟨ 0 ⟩ +[qty] s ≡< qty ℕ > s
L0-3 ⟨ x ⟩ = ↯
L0-3 `∞ = ↯

L0-3′ : ∀ (s : Sens) → s ≡< qty ℕ > ⟨ 0 ⟩ +[qty] s
L0-3′ s = ◇ (lunit[+][qty]< s >)

L0-4 : ∀ (s : Sens) → (s +[qty] ⟨ 0 ⟩) ≡< qty ℕ > s
L0-4 s = runit[+][qty]< s >

L0-4′ : ∀ (s : Sens) → s ≡< qty ℕ > s +[qty] ⟨ 0 ⟩
L0-4′ s = ◇ (runit[+][qty]< s >)

L0-5 : ∀ {N} (Σ₁ : Σ[ N ]) (Σ₂ : Σ[ ꜱ N ]) → ((⟨ 0 ⟩ ∷ Σ₁ ⨰ Σ₂) +[qty] ⟨ 0 ⟩) ≡ (⟨ 0 ⟩ ∷ Σ₁ ⨰ Σ₂)
L0-5 Σ₁ Σ₂ = runit[+][qty]< (⟨ 0 ⟩ ∷ Σ₁ ⨰ Σ₂) >

L0-7 : ∀ (s₁ s₂ : Sens) → (s₁ +[qty] s₂) ≡< qty ℕ > (s₂ +[qty] s₁)
L0-7 s₁ s₂ = commu[+]< s₁ , s₂ >

postulate
  L0-2 : ∀ (s : Sens) → ⟨ 0 ⟩ ×[qty] s ≡< qty ℕ > ⟨ 0 ⟩
  L0-6 : ∀ {N} (s : Sens) (Σ Σ′ : Σ[ N ]) → mapⱽ (_×[qty]_ s) Σ ⨰ Σ′ ≡ s ×[qty] (Σ ⨰ Σ′)
  L0-8 : ∀ (N : ℕ) → ⟨ ∣ N - N ∣ ⟩ ≡< qty ℕ > ⟨ 0 ⟩
  ▵ : ∀ {a b c d N : ℕ} {Σ₁ Σ₂ Σ₃ : Σ[ N ]} → ⟨ ∣ a - b ∣ ⟩ ≤ (Σ₁ ⨰ Σ₃) → ⟨ ∣ c - d ∣ ⟩ ≤ (Σ₂ ⨰ Σ₃) → ⟨ ∣ (a + c) - (b + d) ∣ ⟩ ≤ ((Σ₁ + Σ₂) ⨰ Σ₃)
  L0-9 : ∀ {N} (Σ₁ Σ₂ Σ₃ : Σ[ N ]) → (Σ₁ ⨰ Σ₃) + (Σ₂ ⨰ Σ₃) ≡ ((Σ₁ + Σ₂) ⨰ Σ₃)
  truncDichotomy : ∀ {N} (Σ₁ Σ₂ : Σ[ N ]) → [vec]⌉ Σ₁ ⌈⸢ `∞ ⸣ ⨰ Σ₂ ≡ ⟨ 0 ⟩ ∨ [vec]⌉ Σ₁ ⌈⸢ `∞ ⸣ ⨰ Σ₂ ≡ `∞
  gammaVarValRel : ∀ {N} {γ₁ γ₂ : γ[ N ]} {Σ : Σ[ N ]} {ℾ : ℾ[ N ]} {x : idx N }
    → ⟨ γ₁ , γ₂ ⟩∈𝒢⟦ Σ ː ℾ ⟧
    → (ε₁ : ⊢ γ₁ #[ x ] ⦂ ℾ #[ x ])
    → (ε₂ : ⊢ γ₂ #[ x ] ⦂ ℾ #[ x ])
    → ⟨ γ₁ #[ x ] , γ₂ #[ x ] ⟩∈𝒱′⟦ ℾ #[ x ] ː ε₁ , ε₂ ː Σ #[ x ] ⟧
  L2 : ∀ {N} (s : Sens) (Σ : Σ[ N ]) (τ : τ (ꜱ N)) → (substSx/τ s (⇧ᵗ (⇧ˢ Σ ⟨⟨ τ ⟩⟩))) ≡ (s ∷ Σ) ⟨⟨ τ ⟩⟩
  ▵× : ∀ {N} {r₁₁ r₁₂ r₂₁ r₂₂ : ℕ} {Σ₁ Σ₂ Σ′ : Σ[ N ]} → [vec]⌉ (Σ₁ + Σ₂) ⌈⸢ `∞ ⸣ ⨰ Σ′ ≡ ⟨ 0 ⟩
    → ⟨ ∣ r₁₁ - r₂₁ ∣ ⟩ ≤ (Σ₁ ⨰ Σ′)
    → ⟨ ∣ r₁₂ - r₂₂ ∣ ⟩ ≤ (Σ₂ ⨰ Σ′)
    → ⟨ ∣ r₁₁ ×ᴺ r₁₂ - r₂₁ ×ᴺ r₂₂ ∣ ⟩ ≡< qty ℕ > ⟨ 0 ⟩
  L3 : ∀ {N} {e e′₁ e′₂} {γ₁ γ₂ : γ[ N ]} {ℾ : ℾ[ N ]} {Γ₁ Γ₂} {Σ₁ : Σ[ N ]}
    → γ₁ ⊢ e ⇓ (ƛ⦂ e′₁ ∥ γ₁)
    → γ₂ ⊢ e ⇓ (ƛ⦂ e′₂ ∥ γ₂)
    → mapⱽ (instantiateΣ/τ Σ₁) Γ₁ ⊢ γ₁
    → mapⱽ (instantiateΣ/τ Σ₁) Γ₂ ⊢ γ₂
    → e′₁ ≡ e′₂ ∧ Γ₁ ≡ Γ₂
  L3′ : ∀ {N} {γ₁ γ₂ : γ[ N ]} {ℾ : ℾ[ N ]} {Γ} {Σ : Σ[ N ]}
    → mapⱽ (instantiateΣ/τ zero) Γ ⊢ γ₁
    → mapⱽ (instantiateΣ/τ zero) Γ ⊢ γ₂
    → ⟨ γ₁ , γ₂ ⟩∈𝒢⟦ Σ ː ℾ ⟧
    → ⟨ γ₁ , γ₂ ⟩∈𝒢⟦ Σ ː mapⱽ (instantiateΣ/τ Σ) Γ ⟧
  L4 : ∀ {N} (s₂ s₃ : Sens) (Σ₁ Σ₁₁ Σ₁₂ Σ₂ Σ₃ Σ′ : Σ[ N ])
    → Σ₁ ⨰ Σ′ ≡ `∞
    → ([vec]⌉ Σ₁ ⌈⸢ `∞ ⸣ + ((s₂ ⨵ Σ₁₁) + Σ₂) ⊔ ((s₃ ⨵ Σ₁₂) + Σ₃)) ⨰ Σ′ ≡ `∞
  L5 : ∀ {N} {v₁ v₂ τ} {Σ : Σ[ N ]} → (ε₁ : ⊢ v₁ ⦂ Σ ⟨⟨ τ ⟩⟩)
    → (ε₂ : ⊢ v₂ ⦂ Σ ⟨⟨ τ ⟩⟩)
    → ⟨ v₁ , v₂ ⟩∈𝒱′⟦ Σ ⟨⟨ τ ⟩⟩ ː ε₁ , ε₂ ː `∞ ⟧
  L6 : ∀ {N} (Σ′ : Σ[ N ]) (τ₂ τ₃ τ₁ : τ (ꜱ N))
    → ⇧ᵗ< ᴢ > (⇧ˢ Σ′ ⟨⟨ τ₂ ⟩⟩) ≡ instantiateΣ/τ 𝟎 τ₃
    → ⇧ᵗ< ᴢ > (⇧ˢ Σ′ ⟨⟨ τ₂ ⟩⟩) ≡ instantiateΣ/τ 𝟎 τ₁
    → τ₁ ≡ τ₃
  L7 : ∀ {N} (Σ′ : Σ[ N ]) (τ₃ τ₂ τ₁ : τ N)
    → (Σ′ ⟨⟨ τ₁ ⟩⟩) ≡ instantiateΣ/τ (𝐜< N > ⟨ 0 ⟩) τ₃
    → (Σ′ ⟨⟨ τ₁ ⟩⟩) ≡ instantiateΣ/τ (𝐜< N > ⟨ 0 ⟩) τ₂
    → τ₃ ≡ τ₂
  L8 : ∀ {N} {τ₁ ℾ Σ₁ Σ₂ τ₂ s} {e : Term (ꜱ N)}
    → ℾ ⊢ ƛ⦂ τ₁ ⇒ e ⦂ (ƛ⦂ τ₁ ⇒[ zero ∔ s ∷ Σ₁ ] τ₂) , zero
    → ℾ ⊢ ƛ⦂ τ₁ ⇒ e ⦂ (ƛ⦂ τ₁ ⇒[ zero ∔ s ∷ Σ₂ ] τ₂) , zero
    → Σ₁ ≡ Σ₂
  L9 : ∀ {N} → (Σ₂ Σ′ : Σ[ N ]) → (τ : τ (ꜱ N)) →  (Σ′ ⟨⟨ substΣ/τ ᴢ Σ₂ τ ⟩⟩) ≡ substSx/τ< ᴢ > (Σ₂ ⨰ Σ′) (⇧ᵗ< ᴢ > ((⟨ 0 ⟩ ∷ Σ′) ⟨⟨ τ ⟩⟩))
  typeSafety : ∀ {N} {e : Term N} {Γ : Γ[ N ]} {Σ Σ′ : Σ[ N ]} {v} {γ : γ[ N ]} {τ : τ N} → Γ ⊢ e ⦂ τ , Σ → γ ⊢ e ⇓ v → ⊢ v ⦂ Σ′ ⟨⟨ τ ⟩⟩
  subsumption : ∀ {N} {τ τ₁ τ₂ v₁ v₂  Σ′ } {s₂ s₃ ε₁ ε₂ ε₃ ε₄} {Σ₁ Σ₁₁ Σ₁₂ Σ₂ Σ₃ : Σ[ N ]}  → (τ₁ τ[⊔] τ₂) ≡ ⟨ τ ⟩
    → ⟨ v₁ , v₂ ⟩∈𝒱′⟦ (Σ′ ⟨⟨ τ₁ ⟩⟩) ː ε₃ , ε₄ ː (s₂ ×[qty] ((Σ₁ ⨰ Σ′) +[qty] (⟨ 0 ⟩ +[qty] (Σ′ ⨰ Σ₁₁)))) +[qty] (Σ₂ ⨰ Σ′)⟧
    → ⟨ v₁ , v₂ ⟩∈𝒱′⟦ (Σ′ ⟨⟨ τ ⟩⟩) ː ε₁ , ε₂ ː (([vec]⌉ Σ₁ ⌈⸢ `∞ ⸣ + ((s₂ ⨵ Σ₁₁) + Σ₂) ⊔ ((s₃ ⨵ Σ₁₂) + Σ₃)) ⨰ Σ′)⟧
  delayedΣEq : ∀ {N} {Γ : Γ[ N ]} {e₁ e′₂ τ₁ sx†₁ Σ₁ Σ′₁ τ₂ γ′ γ′₁ Γ₁ τ₁₁ τ₂₁}
    → Γ ⊢ e₁ ⦂ ƛ⦂ τ₁ ⇒[ ⟨ 0 ⟩ ∔ sx†₁ ∷ Σ₁ ] τ₂ , zero
    → γ′ ⊢ e₁ ⇓ (ƛ⦂ e′₂ ∥ γ′₁)
    → Γ₁ ⊢ ƛ⦂ τ₁₁ ⇒ e′₂ ⦂ ƛ⦂ τ₁₁ ⇒[ ⟨ 0 ⟩ ∔ sx†₁ ∷ Σ′₁ ] τ₂₁ , zero
    → Σ₁ ≡ Σ′₁
  gammaDelayedΣEq : ∀ {N} {γ₁ γ₂ Σ′ ℾ Σ′′} {ℾ₁ : Γ[ N ]}
    → ⟨ γ₁ , γ₂ ⟩∈𝒢⟦ Σ′ ː ℾ ⟧
    → ⟨ γ₁ , γ₂ ⟩∈𝒢⟦ Σ′′ ː mapⱽ (instantiateΣ/τ Σ′′) ℾ₁ ⟧
    → Σ′ ≡ Σ′′
